In [19]:
import pandas as pd
import numpy as np

In [21]:
df0 = pd.DataFrame(
    {
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, np.nan],
    'city': ['New York', 'Los Angeles', 'Chicago'],
    'gender': ['F', 'M', 'M'],
    }
)

In [22]:
df0

      name   age         city gender
0    Alice  25.0     New York      F
1      Bob  30.0  Los Angeles      M
2  Charlie   NaN      Chicago      M

In [8]:
nombres = df0['name']  # Accessing the 'name' column

In [9]:
nombres

0      Alice
1        Bob
2    Charlie
Name: name, dtype: object

In [7]:
df0

      name  age         city gender
0    Alice   25     New York      F
1      Bob   30  Los Angeles      M
2  Charlie   35      Chicago      M

In [14]:
df0.shape  # Getting the shape of the DataFrame

(3, 4)

In [16]:
df0.shape[0]  # Getting the number of rows

3

In [23]:
df0.info()  # Getting information about the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     2 non-null      float64
 2   city    3 non-null      object
 3   gender  3 non-null      object
dtypes: float64(1), object(3)
memory usage: 228.0+ bytes

In [17]:
df1 = df0.copy()  # Creating a copy of df0

In [24]:
df0.describe()  # Getting a statistical summary of the DataFrame

             age
count   2.000000
mean   27.500000
std     3.535534
min    25.000000
25%    26.250000
50%    27.500000
75%    28.750000
max    30.000000

In [25]:
name = 'jose'

In [26]:
df0['age'].mean()  # Calculating the mean of the 'age' column

np.float64(27.5)

In [27]:
df0['age'].max()  # Accessing the 'age' column

np.float64(30.0)

In [ ]:
df0['age'].min()  # Accessing the 'age' column

np.int64(25)